/*****
Заполнение таблиц данными.
******/

USE Tour_agency

INSERT INTO User_info
VALUES
('Паханович', 'Сергей', 'Владимирович', '5438297305837382','89098877633','jiji@gmail.com'),
('Панов', 'Никита', 'Владимирович', '1465834567341876' ,'86541235577', 'alo@bk.ru'),
('Марков', 'Владислав', 'Олегович', '2478654323775455', '88885643213', 'fedorneya@mail.ru'),
('Калодин', 'Виктор', 'Александрович', '2578942683572578', '89053213335', 'kakal@gmail.com'),
('Коленка', 'Анна', 'Алексеевна', '3975321579765324', '86546456456', 'kokoro@bk.ru'),
('Притинина', 'Мария', 'Григорьевна', '1573594302729416', '84354367788', 'kolento@bk.ru')

GO

INSERT INTO Countries
VALUES
('Россия'),
('Китай'),
('Америка'),
('Германия'),
('Тайланд'),
('Австралия')

GO

INSERT INTO Hotel
VALUES
(1,'Аква', '3 звезды', 5000),
(2,'Санша', '1 звезда', 2000),
(6,'Олень', '5 звезд', 12000),
(5,'Ирис', '2 звезды', 11000),
(4,'Арша', '1 звезда', 8000),
(3,'Облако', '4 звезды', 10000)

GO

INSERT INTO Airways
VALUES
('Тиксетс', 33333, '5 звезд'),
('Флайнд', 13000, '3  звезды'),
('Тутуру', 8000, ' 1  звезда'),
('Финнаир', 9599, '2  звезды'),
('Авиа', 12455, '3  звезды'),
('Эллинар', 22000, '4  звезды')

GO

INSERT INTO Insurance_agency
VALUES
('Росстрах'),
('Черепаха'),
('Атлант'),
('Евген'),
('Василий'),
('Цветок')

GO

INSERT INTO Insurance_programs
VALUES
('страховка личнго имущества', 123),
('страховка жизни', 333),
('полный комплект страховки', 1488),
('страхование от невыезда', 522),
('страхование багажа', 323),
('страхование несчастного случая', 323)

GO

INSERT INTO Insurance
VALUES
(1, 2),
(4, 5),
(2, 1),
(5, 6),
(3, 3),
(6, 4)

GO

INSERT INTO tour
VALUES
(300000, '21 день', 3, 1, 1),
(212122, '21 день', 2, 6, 1),
(90000, '5 дней', 1, 5, 2),
(30000, '2 дня', 4, 2, 5),
(50000, '6 дней', 5, 3, 4),
(60000, '7 дней', 6, 1, 6)

GO

INSERT INTO Client_order
VALUES
('оплачено', 2, '2018-07-29', 3, 2),
('не оплачено', 1, '2018-08-11', 1, 1),
('оплачено', 3, '2018-07-02', 4, 1),
('оплачено', 1, '2018-03-29', 5, 3),
('не оплачено', 2, '2018-05-23', 6, 4),
('не оплачено', 3, '2018-07-19', 2, 6)

GO
